src/cf/src/InformationRegisters/ОшибкиОбменаДанными/ОшибкиОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОшибкиОбменаДанными</name>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ОшибкиОбменаДанными/ManagerModule.bsl
Процедура ДобавитьДанные(Объект, ТекстОшибки) Экспорт
	МЗ = РегистрыСведений.ОшибкиОбменаДанными.СоздатьМенеджерЗаписи();
	МЗ.Объект = Объект;
	МЗ.ТекстОшибки = ТекстОшибки;
	МЗ.Записать(Истина);
КонецПроцедуры

Процедура УдалитьДанные() Экспорт
	НЗ = РегистрыСведений.ОшибкиОбменаДанными.СоздатьНаборЗаписей();
	НЗ.Записать(Истина);	
КонецПроцедуры
